package com.meteor.meteorcertainidea.lib;

public class LibWords {

    public static final String[] words1 = new String[]{
            "前有***",
            "前无***",
            "前面需要***",
            "前面要小心***",
            "接下来，***会很有用",
            "很可能是***",
            "首先，***吧",
            "以***为目标吧",
            "还没有***哦......",
            "果然是***...",
            "如果有***的话......",
            "居然是***......",
            "有***的预感......",
            "你以为是***吧？",
            "是***的时候了",
            "***啊，***",
            "***，敬请见证",
            "献上***吧",
            "***万岁！",
            "赐予***吧！",
            "啊，***啊......",
            "***",
            "***！",
            "***？",
            "***......"
    };

    public static final String[] words2 = new String[]{
            "火",
            "敌人", "小兵","强敌","怪物","龙","头目","守卫","集团","群聚","陷阱",
            "情人", "天使","有钱人","穷人","好人","坏人","丰满的家伙","细瘦的家伙","可爱的家伙","可怜的家伙",
            "罪犯", "小偷","骗子","卑鄙的家伙","道具","有用的道具","重要的道具","某种东西","某种不得了的东西","宝箱",
            "尸体", "武器","盾牌","弓","防具","材料","花","草","树木","排泄物",
            "门", "梯子","拉杆","按钮","传送门","讯息","血迹","艾尔登法环",
            "近身战","远距离战", "骑马作战", "引战","个别击破","一网打尽","突击","隐秘行动","拟态","扰乱","跟踪","逃跑",
            "召唤", "包抄","跳下去","冲过去","暂歇",
            "攻击", "跳跃攻击","冲刺攻击","致命一击","防御","格挡","防御反击","魔法","恢复","跳跃",
            "蹲下", "锁定目标","制作道具",
            "早上", "白天","傍晚","晚上","晴天","阴天","雨天","暴风雨","起雾","下雪",
            "安全", "危险","绝景","远路","隐藏道路","小路","近路","死胡同","左顾右盼","粗心",
            "大道", "关卡","桥","城","要塞","城市","遗迹","教堂","村庄","塔",
            "家", "墓地","洞窟","坑道","地下室","地面上","地面下","森林","河川","湖泊",
            "东", "南","西","北","前","后","左","右","中央","上",
            "下", "边界",
            "头部", "臀部","腹部","背部","腿部","尾巴","核心",
            "马", "狗","狼","猫","野兽","鸟","僵尸","苦力怕","骷髅","女巫",
            "鱿鱼", "发光鱿鱼","美西螈","蝙蝠","流浪商人","狐狸","驴","骡","僵尸马","骷髅马",
            "炽足兽", "村民","海龟","鸡","哞菇","牛","兔子","绵羊","鹦鹉","猪",
            "掠夺者", "僵尸村民","猪灵","铁傀儡","蠹虫","恶魂","幻翼","唤魔者","烈焰人","溺尸",
            "恼鬼", "潜影贝","尸壳","史莱姆","守卫者","岩浆怪","卫道士","熊猫","羊驼","蜜蜂",
            "北极熊", "蜘蛛","洞穴蜘蛛","海豚","末影人","狼","雪傀儡","凋零","末影龙"

    };

    public static final String[] words3 = new String[]{
            "另外", "或是","但是","所以","反正","不过","对了","也就是说","正因为如此","，"
    };

    public static final String charset = "abcdefghijklmnopqrstuvwxyz";
}
